# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

In [2]:
city_data_df

                city  driver_count   type
0        Richardfort            38  Urban
1       Williamsstad            59  Urban
2        Port Angela            67  Urban
3         Rodneyfort            34  Urban
4        West Robert            39  Urban
..               ...           ...    ...
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

[120 rows x 3 columns]

In [3]:
ride_data_df

                    city                 date   fare        ride_id
0     Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1     South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2     Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3             Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4             South Jack  2019-03-06 04:28:35  34.58  3908451377344
...                  ...                  ...    ...            ...
2370         Michaelberg  2019-04-29 17:04:39  13.38  8550365057598
2371     Lake Latoyabury  2019-01-30 00:05:47  20.76  9018727594352
2372         North Jaime  2019-02-10 21:03:50  11.11  2781339863778
2373        West Heather  2019-05-07 19:22:15  44.94  4256853490277
2374          Newtonview  2019-04-25 10:20:13  55.84  9990581345298

[2375 rows x 4 columns]

### Merge the DataFrames

In [4]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [5]:
#  1. Get the total rides for each city type

pyber_data_df.groupby(["type"]).count()["ride_id"]

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [6]:
# 2. Get the total drivers for each city type

city_data_df.groupby(["type"]).sum()["driver_count"]

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [7]:
#2.2 Get the total drivers count in total

city_data_df.driver_count.sum()

2973

In [8]:
#  3. Get the total amount of fares for each city type
pyber_data_df.groupby(["type"]).sum()["fare"]

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [9]:
#  4. Get the average fare per ride for each city type. 

city_avg_fare = pyber_data_df.groupby(["type"]).mean()["fare"]
city_avg_fare.head()

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
Name: fare, dtype: float64

In [10]:
# 5. Get the average fare per driver for each city type.
# we will calculate ("total fare per ciy type"  / "numbe of of drivers per city type")

In [11]:
# 5-1. Get the total fare per city type

total_fare_per_city_type_df  = pyber_data_df.groupby(["type"]).sum()["fare"]
total_fare_per_city_type_df.head()

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [12]:
# 5-2. total drivers count per city type

drivers_count_per_city_type  = city_data_df.groupby(["type"]).sum()["driver_count"]
drivers_count_per_city_type.head()

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [13]:
# 5.3 lets get the average fare per driver for each city type.

ave_fare_per_driver_per_city_type = pyber_data_df.groupby(["type"]).sum()["fare"] / city_data_df.groupby(["type"]).sum()["driver_count"]
ave_fare_per_driver_per_city_type.head()

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [14]:
#  6. Create a PyBer summary DataFrame. 
pyber_summary_df = pyber_data_df.describe()
pyber_summary_df

              fare       ride_id  driver_count
count  2375.000000  2.375000e+03   2375.000000
mean     26.753112  4.887270e+12     28.930105
std      12.109465  2.907361e+12     20.666306
min       4.050000  3.218337e+08      1.000000
25%      17.190000  2.381175e+12     11.000000
50%      26.600000  4.748541e+12     23.000000
75%      36.645000  7.461936e+12     45.000000
max      58.550000  9.991538e+12     73.000000

In [15]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

In [16]:
#  8. Format the columns.
#pyber_summary_df["fare"] = pyber_summary_df["fare"].map("${:,.2f}".format)
#pyber_summary_df["ride_id"] = pyber_summary_df["ride_id"].map("{:,}".format)
#pyber_summary_df["driver_count"] = pyber_summary_df["driver_count"].map("{:.1f}".format)

pyber_summary_df = round(pyber_summary_df)
pyber_summary_df

         fare       ride_id  driver_count
count  2375.0  2.375000e+03        2375.0
mean     27.0  4.887270e+12          29.0
std      12.0  2.907361e+12          21.0
min       4.0  3.218337e+08           1.0
25%      17.0  2.381175e+12          11.0
50%      27.0  4.748541e+12          23.0
75%      37.0  7.461936e+12          45.0
max      59.0  9.991538e+12          73.0

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [17]:
# 1. Read the merged DataFrame
pyber_data_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural

In [58]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.

pyber_data_df

total_fares_per_week_type = pyber_data_df.groupby(["date","type"]).sum()["fare"]
total_fares_per_week_type

date                 type
2019-01-01 00:08:16  Urban       37.91
2019-01-01 00:46:46  Suburban    47.74
2019-01-01 02:07:24  Suburban    24.07
2019-01-01 03:46:50  Urban        7.57
2019-01-01 05:23:21  Urban       10.75
                                 ...
2019-05-08 04:20:00  Urban       21.99
2019-05-08 04:39:49  Urban       18.45
2019-05-08 07:29:01  Urban       18.55
2019-05-08 11:38:35  Urban       19.77
2019-05-08 13:10:18  Urban       18.04
Name: fare, Length: 2375, dtype: float64

In [ ]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()

In [ ]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date.

In [45]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

In [70]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

import pandas as pd
import io

pyber_data_df = pd.read_table(io.StringIO(data), delim_whitespace=True)

# Converting the index as date
pyber_data_df.index = pd.to_datetime(pyber_data_df.index)

# Extracting hour & minute
pyber_data_df['year'] = pyber_data_df.index.year
pyber_data_df['month'] = pyber_data_df.index.month
pyber_data_df['week'] = pyber_data_df.index.week
pyber_data_df['date'] = pyber_data_df.index.date
pyber_data_df['hour'] = pyber_data_df.index.hour
pyber_data_df['minute'] = pyber_data_df.index.minute
pyber_data_df

                         value  year  month  week        date  hour  minute
2015-09-25 00:46:00  71.925000  2015      9    39  2015-09-25     0      46
2015-09-25 00:47:00  71.625000  2015      9    39  2015-09-25     0      47
2015-09-25 00:48:00  71.333333  2015      9    39  2015-09-25     0      48
2015-09-25 00:49:00  64.571429  2015      9    39  2015-09-25     0      49
2015-09-25 00:50:00  72.285714  2015      9    39  2015-09-25     0      50

In [69]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

import pandas as pd
import io

total_fares_per_week_type = pd.read_table(io.StringIO(data), delim_whitespace=True)

# Converting the index as date
total_fares_per_week_type.index = pd.to_datetime(total_fares_per_week_type.index)

# Extracting hour & minute
total_fares_per_week_type['year'] = total_fares_per_week_type.index.year
total_fares_per_week_type['month'] = total_fares_per_week_type.index.month
total_fares_per_week_type['week'] = total_fares_per_week_type.index.week
total_fares_per_week_type['date'] = total_fares_per_week_type.index.date
total_fares_per_week_type['hour'] = total_fares_per_week_type.index.hour
total_fares_per_week_type['minute'] = total_fares_per_week_type.index.minute
total_fares_per_week_type

                         value  year  month  week        date  hour  minute
2015-09-25 00:46:00  71.925000  2015      9    39  2015-09-25     0      46
2015-09-25 00:47:00  71.625000  2015      9    39  2015-09-25     0      47
2015-09-25 00:48:00  71.333333  2015      9    39  2015-09-25     0      48
2015-09-25 00:49:00  64.571429  2015      9    39  2015-09-25     0      49
2015-09-25 00:50:00  72.285714  2015      9    39  2015-09-25     0      50

In [68]:
# 7. Check that the datatype for the index is datetime using df.info()

date_w = total_fares_per_week_type.index.week
date_w.info()

AttributeError: 'Int64Index' object has no attribute 'info'

In [ ]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [ ]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')